In [1]:
pwd

'/Users/robertkigobe/Documents/My_Research/My_Python/Data_Analysis_Visualizations'

# Dataframes Data Structures

In [2]:
#  a data frame is a two-dimensional data structure with heterogeneous data types, i.e., tabular data.
#DataFrame(data, index, columns, dtype, copy)

## Creating a Data Frame from a List

In [4]:
import pandas as pd
data = [10,20,30,40,50]
DF1 = pd.DataFrame(data)
print (DF1)

    0
0  10
1  20
2  30
3  40
4  50

In [5]:
import pandas as pd
data = [['Ossama',25],['Ali',43],['Ziad',32]]
DF1 = pd.DataFrame(data,columns=['Name','Age'])
print (DF1)

     Name  Age
0  Ossama   25
1     Ali   43
2    Ziad   32

## Creating a DataFrame from a Dictionary

In [10]:
import pandas as pd
data = [{'Test1': 10, 'Test2': 20},{'Test1': 30, 'Test2': 20, 'Project': 20}]
# With three column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['First', 'Second'], columns=['Test2', 'Project' , 'Test1'])
         
#With two column indices with one index with another name
df2 = pd.DataFrame(data, index=['First', 'Second'],columns=['Project', 'Test_1','Test2 '])
print (df1)
print ("\n")
print (df2)

        Test2  Project  Test1
First      20      NaN     10
Second     20     20.0     30


        Project  Test_1  Test2
First       NaN     NaN     NaN
Second     20.0     NaN     NaN

## Creating a Data Frame from a Series

In [11]:
import pandas as pd
data = {'Test1' : pd.Series([70, 55, 89],
index=['Ahmed', 'Omar', 'Ali']),'Test2' : pd.Series([56, 82, 77, 65],
index=['Ahmed', 'Omar', 'Ali', 'Salwa'])}
df1 = pd.DataFrame(data)
print (df1)

       Test1  Test2
Ahmed   70.0     56
Ali     89.0     77
Omar    55.0     82
Salwa    NaN     65

## Updating and Accessing a Data Frameâ€™s Column Selection

In [12]:
import pandas as pd
data = {'Test1' : pd.Series([70, 55, 89],
                 index=['Ahmed', 'Omar', 'Ali']),
                 'Test2' : pd.Series([56, 82, 77, 65],
                 index=['Ahmed', 'Omar', 'Ali', 'Salwa'])}
df1 = pd.DataFrame(data)
print (df1['Test2']) # Column selection
print("\n")
print (df1[:]) # Column selection

Ahmed    56
Ali      77
Omar     82
Salwa    65
Name: Test2, dtype: int64


       Test1  Test2
Ahmed   70.0     56
Ali     89.0     77
Omar    55.0     82
Salwa    NaN     65

### Data Frame Column and Row Selection

In [13]:
df1.iloc[:, [1,0 ]]

       Test2  Test1
Ahmed     56   70.0
Ali       77   89.0
Omar      82   55.0
Salwa     65    NaN

In [14]:
df1[0:4:1]

       Test1  Test2
Ahmed   70.0     56
Ali     89.0     77
Omar    55.0     82
Salwa    NaN     65

## Column Addition

In [15]:
import pandas as pd
data = {'Test1' : pd.Series([70, 55, 89],
                 index=['Ahmed', 'Omar', 'Ali']),
                 'Test2' : pd.Series([56, 82, 77, 65],
                 index=['Ahmed', 'Omar', 'Ali', 'Salwa'])}
df1 = pd.DataFrame(data)
print (df1)
df1['Project'] = pd.Series([90,83,67, 87],
              index=['Ali','Omar','Salwa', 'Ahmed'])
print ("\n")
df1['Average'] = round((df1['Test1']+df1['Test2']+df1['Project'])/3, 2)
print (df1)

       Test1  Test2
Ahmed   70.0     56
Ali     89.0     77
Omar    55.0     82
Salwa    NaN     65


       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Omar    55.0     82       83    73.33
Salwa    NaN     65       67      NaN

## Column Deletion

In [16]:
print (df2)
df2.pop('Project')
print (df2)

        Project  Test_1  Test2
First       NaN     NaN     NaN
Second     20.0     NaN     NaN
        Test_1  Test2
First      NaN     NaN
Second     NaN     NaN

In [18]:
# Delete a column in data frame using del function 
print ("Deleting the first column using DEL function:") 
del df2['Test2']
print (df2)
# Delete a column in data frame using pop function 
print ("\nDeleting another column using POP function:") 
df2.pop('Project')
print (df2)

Deleting the first column using DEL function:
       Test1  Project  Average
Ahmed   70.0       87    71.00
Ali     89.0       90    85.33
Omar    55.0       83    73.33
Salwa    NaN       67      NaN

Deleting another column using POP function:
       Test1  Average
Ahmed   70.0    71.00
Ali     89.0    85.33
Omar    55.0    73.33
Salwa    NaN      NaN

## Creating and Copying a Data Frame

In [17]:
import pandas as pd
data = {'Test1' : pd.Series([70, 55, 89],index=['Ahmed', 'Omar', 'Ali']),
'Test2' : pd.Series([56, 82, 77, 65],
index=['Ahmed', 'Omar', 'Ali', 'Salwa'])}
    

print (df1)
df2 = df1
print ("\n")
print (df2)

       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Omar    55.0     82       83    73.33
Salwa    NaN     65       67      NaN


       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Omar    55.0     82       83    73.33
Salwa    NaN     65       67      NaN

## Row Selection

In [22]:
# add a new Column
import pandas as pd
data = {'Test1' : pd.Series([70, 55, 89],index=['Ahmed', 'Omar', 'Ali']),'Test2' : pd.Series([56, 82, 77, 65],index=['Ahmed', 'Omar', 'Ali', 'Salwa'])}
df1 = pd.DataFrame(data)
df1['Project'] = pd.Series([90,83,67, 87],index=['Ali','Omar','Salwa', 'Ahmed'])
print ("\n")
df1['Average'] = round((df1['Test1']+df1['Test2']+df1 ['Project'])/3, 2)
print (df1)
print ("\nselect iloc function to retrieve row number 2") 
print (df1.iloc[2])
print ("\nslice rows")
print (df1[2:4] )

       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Omar    55.0     82       83    73.33
Salwa    NaN     65       67      NaN

select iloc function to retrieve row number 2
Test1      55.00
Test2      82.00
Project    83.00
Average    73.33
Name: Omar, dtype: float64

slice rows
       Test1  Test2  Project  Average
Omar    55.0     82       83    73.33
Salwa    NaN     65       67      NaN

## Row Addition

In [28]:
import pandas as pd
data = {
    'Test1' : pd.Series([70, 55, 89],index=['Ahmed', 'Omar', 'Ali']),
    'Test2' : pd.Series([56, 82, 77, 65],index=['Ahmed', 'Omar', 'Ali', 'Salwa']),
    'Project' : pd.Series([87, 83, 90, 67],index=['Ahmed', 'Omar', 'Ali', 'Salwa']),
    'Average' : pd.Series([71, 73.33, 85.33, 66],
index=['Ahmed', 'Omar', 'Ali', 'Salwa'])}
data = pd.DataFrame(data)
print (data)
print("\n")
df2 = pd.DataFrame([[80, 70, 90, 80]], columns= ['Test1','Test2','Project','Average'],index=['Khalid'])
data.append(df2)
print (data)

       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Omar    55.0     82       83    73.33
Salwa    NaN     65       67    66.00


       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Omar    55.0     82       83    73.33
Salwa    NaN     65       67    66.00

## Row Deletion

In [29]:
print (data)
print ('\n')
data = data.drop('Omar')
print (data)

       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Omar    55.0     82       83    73.33
Salwa    NaN     65       67    66.00


       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Salwa    NaN     65       67    66.00

## Exploring and Analyzing a Data Frame

In [44]:
print (df1)
data = {
    'Age' : pd.Series([30, 25, 44, ],index=['Ahmed', 'Omar', 'Ali']),
    'Salary' : pd.Series([25000, 17000, 30000, 12000],index=['Ahmed', 'Omar', 'Ali','Salwa']),
    'Height' : pd.Series([160, 154, 175, 165],index=['Ahmed', 'Omar', 'Ali', 'Salwa']),
    'Weight' : pd.Series([85, 70, 92, 65], index=['Ahmed', 'Omar','Ali', 'Salwa']),
    'Gender' : pd.Series(['Male', 'Male', 'Male', 'Female'],index=['Ahmed', 'Omar','Ali','Salwa'])
        }
data = pd.DataFrame(data)
print (data)
print("\n")
df2 = pd.DataFrame([[42, 31000, 170, 80, 'Female']], columns=['Age','Salary','Height'], index=['Mona'])
data = data.append(df2)
print (data)

       Test1  Test2  Project  Average
Ahmed   70.0     56       87    71.00
Ali     89.0     77       90    85.33
Omar    55.0     82       83    73.33
Salwa    NaN     65       67      NaN
        Age  Salary  Height  Weight  Gender
Ahmed  30.0   25000     160      85    Male
Ali    44.0   30000     175      92    Male
Omar   25.0   17000     154      70    Male
Salwa   NaN   12000     165      65  Female

ValueError: 3 columns passed, passed data had 5 columns

In [45]:
data.describe()

             Age        Salary      Height     Weight
count   3.000000      4.000000    4.000000   4.000000
mean   33.000000  21000.000000  163.500000  78.000000
std     9.848858   8041.558721    8.888194  12.622731
min    25.000000  12000.000000  154.000000  65.000000
25%    27.500000  15750.000000  158.500000  68.750000
50%    30.000000  21000.000000  162.500000  77.500000
75%    37.000000  26250.000000  167.500000  86.750000
max    44.000000  30000.000000  175.000000  92.000000

In [46]:
data.describe(include='all')

              Age        Salary      Height     Weight Gender
count    3.000000      4.000000    4.000000   4.000000      4
unique        NaN           NaN         NaN        NaN      2
top           NaN           NaN         NaN        NaN   Male
freq          NaN           NaN         NaN        NaN      3
mean    33.000000  21000.000000  163.500000  78.000000    NaN
std      9.848858   8041.558721    8.888194  12.622731    NaN
min     25.000000  12000.000000  154.000000  65.000000    NaN
25%     27.500000  15750.000000  158.500000  68.750000    NaN
50%     30.000000  21000.000000  162.500000  77.500000    NaN
75%     37.000000  26250.000000  167.500000  86.750000    NaN
max     44.000000  30000.000000  175.000000  92.000000    NaN

In [47]:
data.Salary.describe()

count        4.000000
mean     21000.000000
std       8041.558721
min      12000.000000
25%      15750.000000
50%      21000.000000
75%      26250.000000
max      30000.000000
Name: Salary, dtype: float64

In [49]:
import numpy as np
data.describe(include=[np.number])

             Age        Salary      Height     Weight
count   3.000000      4.000000    4.000000   4.000000
mean   33.000000  21000.000000  163.500000  78.000000
std     9.848858   8041.558721    8.888194  12.622731
min    25.000000  12000.000000  154.000000  65.000000
25%    27.500000  15750.000000  158.500000  68.750000
50%    30.000000  21000.000000  162.500000  77.500000
75%    37.000000  26250.000000  167.500000  86.750000
max    44.000000  30000.000000  175.000000  92.000000

In [50]:
data.describe(include=[np.object])

<ipython-input-50-c07674af406a>:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  data.describe(include=[np.object])

       Gender
count       4
unique      2
top      Male
freq        3

In [51]:
data.describe(exclude=[np.number])

       Gender
count       4
unique      2
top      Male
freq        3

In [52]:
data

        Age  Salary  Height  Weight  Gender
Ahmed  30.0   25000     160      85    Male
Ali    44.0   30000     175      92    Male
Omar   25.0   17000     154      70    Male
Salwa   NaN   12000     165      65  Female

In [53]:
OptimalWeight = data['Height']- 100
OptimalWeight

Ahmed    60
Ali      75
Omar     54
Salwa    65
Name: Height, dtype: int64

In [54]:
unOptimalCases = data['Weight'] <= OptimalWeight
unOptimalCases

Ahmed    False
Ali      False
Omar     False
Salwa     True
dtype: bool

In [58]:
grouped = data.groupby('Gender')
print (grouped.get_group('Male'))

        Age  Salary  Height  Weight Gender
Ahmed  30.0   25000     160      85   Male
Ali    44.0   30000     175      92   Male
Omar   25.0   17000     154      70   Male

In [60]:
import numpy as np
grouped = data.groupby('Gender')
print (grouped['Height'].agg(np.mean))
print ("\n")
print (grouped['Weight'].agg(np.mean))
print ("\n")
print (grouped.agg(np.size))
print ("\n")
print (grouped['Height'].agg([np.sum, np.mean,np.std]))

Gender
Female    165
Male      163
Name: Height, dtype: int64


Gender
Female    65.000000
Male      82.333333
Name: Weight, dtype: float64


        Age  Salary  Height  Weight
Gender
Female  1.0       1       1       1
Male    3.0       3       3       3


        sum  mean        std
Gender
Female  165   165        NaN
Male    489   163  10.816654

In [64]:
import pandas as pd
import numpy as np
Number = [1,2,3,4,5,6,7,8,9,10]
Names = ['Ali Ahmed','Mohamed Ziad','Majid Salim','Salwa',
'Ahmed', 'Ahlam Mohamed', 'Omar Ali', 'Amna Mohammed','Khalid',
'Yousif', 'Safa Humaid', 'Amjad Tayel']
City = ['Fujairah','Dubai','Sharjah','AbuDhabi','Fujairah','Dubai', 'Sharja ', 'AbuDhabi','Sharjah','Fujairah']columns = ['Number', 'Name', 'City' ]
dataset= pd.DataFrame({'Number': Number , 'Name': Names,'City': City}, columns = columns )
Gender= pd.DataFrame({'Gender':['Male','Male','Male','Female',
'Female', 'Male', 'Female', 'Male','Female', 'Male']})
Height = pd.DataFrame(np.random.randint(120,175, size=(12, 1)))
Weight = pd.DataFrame(np.random.randint(50,110, size=(12, 1)))
dataset['Gender']= Gender
dataset['Height']= Height
dataset['Weight']= Weight
dataset.set_index('Number')

SyntaxError: invalid syntax (<ipython-input-64-578deebebe65>, line 7)